InformationRegisters/СведенияОСтавкахНалоговСборовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСтавкахНалоговСборовОтчислений</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Вид налога/сбора/отчисления</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НалогиСборыОтчисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СведенияОСтавкахНалоговСборовОтчислений/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура - обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.Период < Дата('20200101')
			И ЗначениеЗаполнено(СтрокаНабора.ВидДохода) Тогда
			
			ВызватьИсключение НСтр("ru = 'Сведения о ставках налогов, сборов и отчислений в разрезе вида дохода указываются только с 01.01.2020 года.'");
			
		КонецЕсли;
		
		Если СтрокаНабора.Период >= Дата('20200101')
			И ЗначениеЗаполнено(СтрокаНабора.ВидДохода) 
			И СтрокаНабора.ВидНалога <> ПредопределенноеЗначение("Справочник.НалогиСборыОтчисления.ИндивидуальныйПодоходныйНалог")
		    И СтрокаНабора.ВидНалога <> ПредопределенноеЗначение("Справочник.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносы") Тогда
			
			ВызватьИсключение НСтр("ru = 'Сведения о ставках налогов, сборов и отчислений в разрезе вида дохода указываются только для налогов: ОПВ и ИПН с 01.01.2020 года.'");
			
		КонецЕсли;

		Если СтрокаНабора.ВидНалога = Справочники.НалогиСборыОтчисления.ЕдиныйПлатеж Тогда
			
			Если СтрокаНабора.Период < Дата('20230101') Тогда
				
				ВызватьИсключение НСтр("ru = 'Сведения о ставке единого платежа указываются с 01.01.2023 года.'");
				
			ИначеЕсли СтрокаНабора.ВидДохода = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				
				ВызватьИсключение НСтр("ru = 'Сведения о ставке единого платежа указываются только для дохода от работодателя.'");
				
			КонецЕсли;
			
		КонецЕсли;

		Если СтрокаНабора.ВидНалога = Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя Тогда
			
			Если СтрокаНабора.Период < Дата('20240101') Тогда
				
				ВызватьИсключение НСтр("ru = 'Сведения о ставке обязательных пенсионных взносов за счет работодателя указываются с 01.01.2024 года.'");
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
